{"doc": {"cmplid": "620680", "odino": "10183576", "mfr_name": "TOYOTA MOTOR CORPORATION", "maketxt": "TOYOTA", "modeltxt": "TACOMA", "yeartxt": "2003", "crash": "Y", "faildate": "2007-02-05", "fire": "N", "injured": "0", "deaths": "0", "compdesc": "VEHICLE SPEED CONTROL", "city": "SAN JOSE", "state": "CA", "vin": "5TEGN92N63Z", "datea": "2007-02-26", "ldate": "2007-02-26", "miles": "45000", "occurrences": "3", "cdescr": "TL*- THE CONTACT PURCHASED ON 07/29/03 A 2003 TOYOTA TACOMA FOUR DOOR DBL CAB.  THE FIRST FAILURE OCCURRED ON 4/25/04 WHILE SLOWLY PULLING INTO A PARKING PLACE WITH AND LIGHTLY ACCELERATING, THE ENGINE REVVED SO FAST THE TRUCK DROVE OVER THE PARKING STRIP AND CRASHED INTO A PILLAR ON THE SIDEWALK,  CAUSING $5000.00 WORTH OF DAMAGE TO TRUCK, AND  $6000.00 DAMAGE TO THE PILLAR. DURING THE SECOND OCCURRENCE ON 10/09/06 VEHICLE STOPPED AT A RED LIGHT AND  THE ENGINE ACCELERATED SO THE  CONTACT  PUT IT IN TO NEUTRAL AND ENGINE REVVED FASTER. THE DRIVER THEN SHIFTED THE VEHICLE BACK INTO DRIVE AND ENGINE RETURNED TO NORMAL IN A COUPLE SECONDS. DURING THIRD OCCURRENCE ON 02/05/07  WHILE  STOPPING AT A RED LIGHTTHE  ENGINE REVVED AND WENT BACK TO NORMAL BEFORE  THE CONTACT5  COULD TURN OFF THE KEY. IF THERE HAD BEEN A CAR IN FRONT OF THE  CONTACT'S VEHICLE IT WOULD HAVE CAUSED A CRASH. THE FIRST TWO TIMES THE CONTACT TOOK THE TRUCK TO THE DEALER.  EACH TIME THEY COULD NOT FIND ANYTHING, AND GENTLY SUGGESTED THAT MAYBE THE ACCELERATOR  AND  BRAKES WERE BOTH ENGAGED AT THE SAME TIME.   FIRST TIME THE CONTACT'S FOOT WAS ON THE ACCELERATOR, AND THE OTHER TIMES IT WAS ONLY ON THE BRAKES, THAT WAS THE FIRST THING THE CONTACT CHECKED. THE SERVICE MANAGER  ADVISED HER NOT TO DRIVE  THIS VEHICLE  SO SHE RENTED A VEHICLE FOR A COUPLE DAYS. THEY HAD SOMEONE FROM TOYOTA COME TO CHECK IT OUT, BUT THEY COULD NOT FIND ANYTHING WRONG.  *AK", "cmpl_type": "EMAIL MESSAGE", "police_rpt_yn": "N", "purch_dt": "2003-07-29", "orig_owner_yn": "Y", "anti_brakes_yn": "Y", "cruise_cont_yn": "Y", "num_cyls": "6", "drive_train": "FWD", "fuel_sys": "FI", "fuel_type": "GAS", "trans_type": "AUTO", "veh_speed": "0", "dealer_name": "CAPITOL TOYOTA", "dealer_city": "SAN JOSE", "dealer_state": "CA", "prod_type": "VEHICLE"}}