{"doc": {"cmplid": "620702", "odino": "10183592", "mfr_name": "VOLKSWAGEN OF AMERICA, INC", "maketxt": "VOLKSWAGEN", "modeltxt": "PASSAT", "yeartxt": "2004", "crash": "Y", "faildate": "2006-11-06", "fire": "N", "injured": "1", "deaths": "0", "compdesc": "SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE LIGHT", "city": "KENT", "state": "WA", "vin": "WVWVD63B24E", "datea": "2007-02-26", "ldate": "2007-02-26", "miles": "35880", "occurrences": "1", "cdescr": "1. WHEN CAR IN FRONT OF THE PASSAT SLOWED, THE DRIVER APPLIED THE BRAKES AND THE ABS LIGHT AND ASR LIGHTS CAME ON BUT THE BRAKES DID NOT WORK. THE PASSAT WAS NOT GOING QUICKLY AND HAD SAFE STOPPING DISTANCE SO THE CAR HAD PLENTY OF TIME TO STOP. THE PASSAT DID NOT STOP, HITTING THE CAR AHEAD OF IT.  2. THE BRAKES FAILED, CAUSING THE PASSAT TO REAR-END THE CAR IN FRONT OF IT. THE DRIVER OF THE OTHER CAR SUSTAINED WHIPLASH INJURIES AND 600 USD TO HIS CAR. HE IS IN TREATMENT WITH THE COST OF TREATMENT UNDETERMINED AT THIS TIME. THE PASSAT SUSTAINED 3000 USD IN DAMAGE. THE DRIVER OF THE PASSAT WAS NOT INJURED, WAS TICKETED, LOST HALF A DAY'S WAGES IN COURT, AND DOES NOT TRUST HIS VEHICLE.  3. THE CAR WAS TAKEN TO THE VW DEALERSHIP, WHERE IT WAS DETERMINED THAT A BRAKE LIGHT SWITCH WAS DETERMINED TO BE ELECTRICALLY FAULTY. MALFUNCTIONS WERE STORED IN THE ABS CONTROL MODULE. THE BRAKE LIGHT SWITCH GAVE AN IMPLAUSIBLE SIGNAL, SPORADIC. THE BRAKE LIGHT SWITCH WAS DIAGNOSED AND REPLACED. THE FAULT MEMORY OF THE ABS CONTROL MODULE WAS ERASED AND RESET.  THE DRIVER OF THE PASSAT CONTACTED VW ASKING ABOUT THE FAULT(S) AND EXPRESSING HIS DOUBT IN THE SAFETY AND RELIABILITY OF THE VEHICLE. THE DRIVER OF THE PASSAT FELT VW'S DEFECTIVE PARTS CAUSED THE ACCIDENT AND VW SHOULD COVER THE COST. VW'S ANSWER IS THAT THE DEFECTIVE PARTS COULD NOT HAVE CAUSED THE ACCIDENT.   TONIGHT'S PAPER HAS ISSUED INFORMATION ABOUT A RECALL OF THIS PART HOWEVER, IT DOES NOT INCLUDE INFORMATION ABOUT PASSATS IN THIS RECALL. PASSATS HAVE THIS PROBLEM, TOO. WE DID NOT KNOW ABOUT YOUR ORGANIZATION OR WE WOULD HAVE CONTACTED YOU MONTHS AGO. *JB", "cmpl_type": "NHTSA WEB SITE", "police_rpt_yn": "Y", "purch_dt": "2004-12-15", "orig_owner_yn": "Y", "anti_brakes_yn": "Y", "cruise_cont_yn": "Y", "num_cyls": "4", "drive_train": "FWD", "fuel_sys": "FI", "fuel_type": "GAS", "trans_type": "AUTO", "veh_speed": "25", "dealer_name": "AUBURN VOLKSWAGEN", "dealer_tel": "253-833-4940", "dealer_city": "AUBURN", "dealer_state": "WA", "dealer_zip": "98002", "prod_type": "VEHICLE"}}